QuickSkill/app/views/posts/_form.html.erb

SELECT "topics".* FROM "topics"
---
	<%= f.input :title %>
	<%= f.input :topic_id, :collection => Topic.all %>