QuickSkill/app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
    user_id = post.user_id %>
   <% @user = User.find(user_id) %>