QuickSkill/app/views/posts/looking_for.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
    user_id = post.user_id %>
   <% @user = User.find(user_id) %>