QuickSkill/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%hello%' OR description LIKE '%hello%' OR location '%hello%')
---
  def search
    @posts = Post.search(params[:search])

SELECT "posts".* FROM "posts"
---
  def looking_for
    @all_posts = Post.all

SELECT "posts".* FROM "posts"
---
  def offering
    @all_posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find params[:id]
    user_id = @post.user_id
    @user = User.find(user_id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @post = Post.find params[:id]

INSERT INTO "posts" ("title", "topic_id", "price", "location", "description", "looking_for", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
  def destroy
      @post = Post.find params[:id]
      @post.destroy