QuickSkill/app/controllers/reviews_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("body", "rating", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "tyum;l"], ["rating", 10], ["profile_id", 1], ["created_at", "2015-07-08 19:43:59.205661"], ["updated_at", "2015-07-08 19:43:59.205661"]]
UPDATE "reviews" SET "user_id" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["user_id", 1], ["updated_at", "2015-07-08 19:43:59.420686"], ["id", 1]]
---
  def create
  	@profile = Profile.find(params[:profile_id])
    user_id = @profile.user_id
    @user = User.find(user_id)

    @review = @profile.reviews.create(review_params)
    @review.user_id = current_user.id
    @review.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."profile_id" = $1 AND "reviews"."id" = $2 LIMIT 1  [["profile_id", 1], ["id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
 def destroy
      @profile = Profile.find(params[:profile_id])
      user_id = @profile.user_id
      @user = User.find(user_id)
      @review = @profile.reviews.find(params[:id])
      @review.destroy