QuickSkill/app/controllers/topics_controller.rb

	def show
		@all_posts = Post.all
		@topic = Topic.find params[:id]
---
SELECT "posts".* FROM "posts"
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", 7]]