app/views/posts/index.html.erb

                    <% user_id = post.user_id %>
                    <% @user = User.find(user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 17]]