app/views/posts/show.html.erb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", 10]]
---

<% topic = Topic.find(@post.topic_id) %>