app/controllers/email_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 17]]
---
	def send_contact_email
		@post = Post.find(params[:post])
	    user_id = @post.user_id
	    @recipient = User.find(user_id)