app/controllers/profiles_controller.rb

  def new
    @user = User.find params[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 17]]

  def show
    @profile = Profile.find params[:id]
    user_id = @profile.user_id
    @user = User.find(user_id)
    @posts = @user.posts.all
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 17]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 20]]

  def edit
    @profile = Profile.find params[:id]
    user_id = @profile.user_id
    @user = User.find(user_id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 21]]

  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    if @profile.save
---
INSERT INTO "profiles" ("name", "location", "biography", "phone_number", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @profile = Profile.find(params[:id])
    user_id = @profile.user_id
    @user = User.find(user_id)
     if @profile.update(profile_params)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 21]]
UPDATE "profiles" SET "avatar_updated_at" = $1, "avatar_file_name" = $2, "updated_at" = $3 WHERE "profiles"."id" = $4  [["avatar_updated_at", "2015-07-09 14:07:41.151236"], ["avatar_file_name", "DSC_0020.JPG"], ["updated_at", "2015-07-09 14:07:41.935476"], ["id", 4]]